Documents/Renault_ВозвратСтраховогоПолиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ВозвратСтраховогоПолиса</Name>
			<BasedOn>
				<xr:Item>Document.Renault_СтраховойПолис</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_КвитанцииКПолисам</xr:Item>
				<xr:Item>InformationRegister.Renault_СтатусыБСО</xr:Item>
				<xr:Item>AccumulationRegister.Renault_ВзаиморасчетыСоСтрахователями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетОрганизации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПлательщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезКвитанции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВернутьЧастьСуммы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Renault_ВозвратСтраховогоПолиса/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Renault_СтраховойПолис") Тогда
		// Заполнение шапки
		Агент=ДанныеЗаполнения.Агент;
		Банк = ДанныеЗаполнения.Банк;
		//БанковскийСчетОрганизации = ДанныеЗаполнения.БанковскийСчетОрганизации;
		//ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		ВидОплаты = ДанныеЗаполнения.ЗаказПокупателя.ВидОплаты;
		ДоговорПлательщика = ДанныеЗаполнения.ЗаказПокупателя.ДоговорВзаиморасчетов;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ЗаказПокупателя = ДанныеЗаполнения.ЗаказПокупателя;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		//ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		//КратностьВзаиморасчетов=1; //ДанныеЗаполнения.ЗаказПокупателя.КратностьВзаиморасчетов;
		//КурсВзаиморасчетов=; //ДанныеЗаполнения.ЗаказПокупателя.КурсВзаиморасчетов;
		//НомерБСО = ДанныеЗаполнения.НомерБСО;
		Организация = ДанныеЗаполнения.Организация;
		Плательщик = ДанныеЗаполнения.Плательщик;
		//Подразделение = ДанныеЗаполнения.Подразделение;
		//Проект = ДанныеЗаполнения.Проект;
		//СерияБСО = ДанныеЗаполнения.СерияБСО;
		СтраховойПолис = ДанныеЗаполнения.Ссылка;
		
		//СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		//ТипБСО = ДанныеЗаполнения.ТипБСО;
		//ТипЦен = ДанныеЗаполнения.ТипЦен;
		ТочкаПродаж = ДанныеЗаполнения.ТочкаПродаж;
		//УсловиеПродаж = ДанныеЗаполнения.УсловиеПродаж;
		//УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
		//РеализацияТоваров = ДанныеЗаполнения.РеализацияТоваров;
		//КорректировкаРеализации = ДанныеЗаполнения.КорректировкаРеализации;
		//ЗакрытиеЗаказаПокупателя = ДанныеЗаполнения.ЗакрытиеЗаказаПокупателя;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//// регистр Renault_ВзаиморасчетыСоСтрахователями Приход
	//Движения.Renault_ВзаиморасчетыСоСтрахователями.Записывать = Истина;
	//Движения.Renault_ВзаиморасчетыСоСтрахователями.Очистить();
	//Движение = Движения.Renault_ВзаиморасчетыСоСтрахователями.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//Движение.Период = Дата;
	//Движение.Организация = Организация;
	//Движение.Страхователь = Контрагент;
	//Движение.СтраховойПолис = СтраховойПолис;
	//Движение.Сумма = СуммаДокумента;

	//Движения.Renault_КвитанцииКПолисам.Записывать = Истина;
	//Движения.Renault_КвитанцииКПолисам.Очистить();
	//
	//Движения.Renault_СтатусыБСО.Записывать = Истина;
	//Движения.Renault_СтатусыБСО.Очистить();
	//
	//Если НЕ БезКвитанции Тогда
	//	// регистр Renault_КвитанцииКПолисам
	//	Движение = Движения.Renault_КвитанцииКПолисам.Добавить();
	//	Движение.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания;
	//	Движение.ТипБСО = ТипБСО;
	//	Движение.СерияБСО = СерияБСО;
	//	Движение.НомерБСО = НомерБСО;
	//	Движение.СтраховойПолис = СтраховойПолис;
	//	
	//	// регистр Renault_СтатусыБСО
	//	Движение = Движения.Renault_СтатусыБСО.Добавить();
	//	Движение.Период = Дата;
	//	Движение.Организация = Организация;
	//	Движение.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания;
	//	Движение.ТипБСО = ТипБСО;
	//	Движение.СерияБСО = СерияБСО;
	//	Движение.НомерБСО = НомерБСО;
	//	Движение.Статус = Перечисления.Renault_СтатусыБСО.Продан;
	//	
	//КонецЕсли;	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПечатьНаправленияВКассу() Экспорт
	
	Если НЕ Проведен Тогда
		Сообщить("Направление может быть распечатано только после проведения документа");	
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("НаправлениеВКассу");	
    Область = Макет.ПолучитьОбласть("Направление");
	Область.Параметры.Заголовок = "Направление на возврат № " + Ссылка.Номер;
	Область.Параметры.НомерПолиса = "" + СокрЛП(СтраховойПолис.СерияБСО) + " " + СокрЛП(СтраховойПолис.НомерБСО);
	Область.Параметры.ДатаЗаключения = СтраховойПолис.ДатаСтрахования;
	Область.Параметры.Дата = ДатаОплаты;
	Область.Параметры.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания;
	Область.Параметры.Сумма = "" + Цел(СуммаДокумента) + " руб. " + Прав(Формат(СуммаДокумента, "ЧДЦ=2"), 2) + " коп.";
	Область.Параметры.Агент = Агент;
	Область.Параметры.Контрагент = Контрагент;
	
	ТабДок.Вывести(Область);
	
	ТабДок.Показать();

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если ВернутьЧастьСуммы И НЕ ЗначениеЗаполнено(КорректировкаРеализации) Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			СоздатьКорректировкуРеализации();
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Попытка
			
			КорректировкаОбъект = КорректировкаРеализации.ПолучитьОбъект();
			КорректировкаОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КорректировкаРеализации = Документы.КорректировкаРеализации.ПустаяСсылка();
			
			Если ЗначениеЗаполнено(ПлатежныйДокумент) Тогда
				Сообщить("Необходимо отменить проверение платежного документа и удалить ссылку");
			КонецЕсли;	
			
		Исключение
			
		КонецПопытки;			
	КонецЕсли;	
		
	
	//Временное отключение проверки
	//Возврат;
	
	//Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	Возврат;
	//КонецЕсли;	
	//
	//Если НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	
	//	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
	//		Сообщить("Оплата должна быть введена на основании страхового полиса!");	
	//	КонецЕсли;	
	//	
	//	Если СтраховойПолис.ОплатаСК Тогда
	//		Сообщить("Для прямой оплаты страховой компании ввод документов оплаты не требуется!");
	//		Отказ = истина;
	//	КонецЕсли;
	//	
	//	Если СтраховойПолис.СтатусДокумента <> Перечисления.Renault_СтатусыСтраховыхПолисов.ВРаботе И СтраховойПолис.СтатусДокумента <> Перечисления.Renault_СтатусыСтраховыхПолисов.Продан Тогда
	//		Сообщить("Для оплаты полиса установите статус ""В работе"" или ""Продан""!");
	//		Отказ = истина;
	//	КонецЕсли;	
	//	
	//	Если НЕ БезКвитанции Тогда
	//		Если НЕ ЗначениеЗаполнено(ТипБСО) Тогда
	//			Сообщить("Необходимо заполнить тип БСО!");
	//			Отказ = Истина;
	//		КонецЕсли;
	//		//Если НЕ ЗначениеЗаполнено(СерияБСО) Тогда
	//		//	Сообщить("Необходимо заполнить серию БСО!");
	//		//	Отказ = Истина;
	//		//КонецЕсли;
	//		Если НЕ ЗначениеЗаполнено(НомерБСО) Тогда
	//			Сообщить("Необходимо заполнить номер БСО!");
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;	
	//	
	//	ТаблицаБСО = Renault_УчетБСО.ПолучитьПустуюТаблицуБСО();
	//	НоваяСтрока = ТаблицаБСО.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект);
	//	НоваяСтрока.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания;
	//	НоваяСтрока.Количество = 1;
	//	
	//	Если НЕ БезКвитанции Тогда
	//		ЕстьБСОНаТочке = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, СтраховойПолис.СтраховаяКомпания, ТочкаПродаж, истина);
	//		Если НЕ ЕстьБСОНаТочке Тогда
	//			Отказ = истина;	
	//		КонецЕсли;	
	//	
	//		Запрос = Новый Запрос;
	//		Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховойПолис.СтраховаяКомпания);
	//		Запрос.УстановитьПараметр("ТипБСО", ТипБСО);
	//		Запрос.УстановитьПараметр("СерияБСО", СерияБСО);
	//		Запрос.УстановитьПараметр("НомерБСО", НомерБСО);
	//		Запрос.Текст = "ВЫБРАТЬ
	//					   |	Renault_КвитанцииКПолисам.СтраховойПолис,
	//					   |	Renault_КвитанцииКПолисам.СтраховаяКомпания,
	//					   |	Renault_КвитанцииКПолисам.ТипБСО,
	//					   |	Renault_КвитанцииКПолисам.СерияБСО,
	//					   |	Renault_КвитанцииКПолисам.НомерБСО
	//					   |ИЗ
	//					   |	РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
	//					   |ГДЕ
	//					   |	Renault_КвитанцииКПолисам.ТипБСО = &ТипБСО
	//					   |	И Renault_КвитанцииКПолисам.СтраховаяКомпания = &СтраховаяКомпания
	//					   |	И Renault_КвитанцииКПолисам.СерияБСО = &СерияБСО
	//					   |	И Renault_КвитанцииКПолисам.НомерБСО = &НомерБСО";
	//					   
	//		Если НЕ ЭтоНовый() Тогда
	//			Запрос.Текст = Запрос.Текст + "
	//						   |	И Renault_КвитанцииКПолисам.Регистратор <> &Ссылка";
	//			Запрос.УстановитьПараметр("Ссылка", Ссылка);			   
	//		КонецЕсли;				   
	//		Выборка = Запрос.Выполнить().Выбрать();
	//		Пока Выборка.Следующий() Цикл
	//			Сообщить("Квитанция " + СокрЛП(Выборка.ТипБСО) + " " + СокрЛП(Выборка.СерияБСО) + " " + СокрЛП(Выборка.НомерБСО) + " уже введена для полиса " + Выборка.СтраховойПолис);
	//			Отказ = истина;
	//		КонецЦикла;	
	//	КонецЕсли;
	//КонецЕсли;	
	//
	//Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	
	//	Если ЗначениеЗаполнено(ПлатежныйДокумент) Тогда
	//		Сообщить("Нельзя отменять проведение документа, если на кассе введен платежный документ");
	//		Отказ = истина;
	//	КонецЕсли;	
	//	
	//КонецЕсли;
	//
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	
	//	Если НЕ ЗначениеЗаполнено(ДокументОснование) 
	//		ИЛИ ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка() 
	//		ИЛИ НЕ ЗначениеЗаполнено(ЗаказПокупателя) 
	//		ИЛИ ЗаказПокупателя <> ДокументОснование.ЗаказПокупателя 
	//		ИЛИ (ДокументОснование.СтатусДокумента <> Перечисления.Renault_СтатусыСтраховыхПолисов.ВРаботе 
	//		И ДокументОснование.СтатусДокумента <> Перечисления.Renault_СтатусыСтраховыхПолисов.Продан) 
	//		ИЛИ НЕ ДокументОснование.Проведен Тогда
	//		Сообщить("Полис был изменен, либо не проведен, либо не установлен статус ""В работе"" или ""Продан""");
	//		Сообщить("Если полис не проведен или имеет другой статус, то установите статус, перепроведите полис и заново введите оплату");
	//		Сообщить("Если статус полиса верный и он проведен, то введите новый документ ""Оплата страхового полиса""");
	//		Сообщить("Если документ ""Оплата страхового полиса"" открыт, то закройте его без сохранения и введите заново");
	//		Отказ = истина;
	//	КонецЕсли;	
	//	
	//КонецЕсли;
	
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьКорректировкуРеализации()
	
	Попытка
		КорректировкаОбъект = Документы.КорректировкаРеализации.СоздатьДокумент();
		КорректировкаОбъект.Заполнить(РеализацияТоваров);
		КорректировкаОбъект.Комментарий = "Сформирован из документа " + ЭтотОбъект;
		КорректировкаОбъект.Дата = ТекущаяДата();
		Если КорректировкаОбъект.Услуги.Количество() > 0 Тогда
			СтрокаУслуг = КорректировкаОбъект.Услуги[0];
			СтрокаУслуг.Количество = 1;
			СтрокаУслуг.Цена = СтрокаУслуг.Цена - СуммаДокумента;
			СтрокаУслуг.Сумма = СтрокаУслуг.Сумма - СуммаДокумента;
			СтрокаУслуг.ОтражатьТоварныйУчет = истина;
			КорректировкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КорректировкаРеализации = КорректировкаОбъект.Ссылка;
		Иначе
			КорректировкаРеализации = Документы.КорректировкаРеализации.ПустаяСсылка(); 
		КонецЕсли;	
	Исключение
		КорректировкаРеализации = Документы.КорректировкаРеализации.ПустаяСсылка(); 
	КонецПопытки;	
	
КонецПроцедуры
